Revit 2024 API
KeyBasedTreeEntries Methods
The KeyBasedTreeEntries type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
FindEntry
 Finds the KeyBasedTreeEntry associated with the given key value.
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetEnumerator
Returns an enumerator that iterates through a collection.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetKeyBasedTreeEntriesIterator
 Returns a KeyBasedTreeEntriesIterator that iterates through the collection.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
KeyBasedTreeEntries Class
Autodesk.Revit.DB Namespace